app/Controllers/Biodata.php

SELECT *
FROM `user`
WHERE `email` = 'reni@gmail.com'
 LIMIT 1
---
    public function index()
    {
        if (!session('email')) {
            dd("Login Dulu");
        }

        $UserID = $this->ModelUser->where('email', session('email'))->first()['idUser'];