app/Controllers/Dashboard.php

    public function index()
    {
        $UserID = $this->ModelUser->where('email', session('email'))->first()['idUser'];
---
SELECT *
FROM `user`
WHERE `email` = 'reni@gmail.com'
 LIMIT 1