app/Models/ModelPendaftar.php

    public function getPendaftar($idPendaftar = false)
    {
        if ($idPendaftar == false) {
            return $this->findAll();
        }

        return $this->where(['idPendaftar' => $idPendaftar])->first();
---
SELECT *
FROM `data_pendaftar`
SELECT *
FROM `data_pendaftar`
WHERE `idPendaftar` = '1'
 LIMIT 1

    public function getPendaftarDiterima()
    {
        return $this->where('status_daftar', 'Diterima')->findAll();
---
SELECT *
FROM `data_pendaftar`
WHERE `status_daftar` = 'Diterima'

    public function getPendaftarDitolak()
    {
        return $this->where('status_daftar', 'Ditolak')->findAll();
---
SELECT *
FROM `data_pendaftar`
WHERE `status_daftar` = 'Finalisasi'

    public function getPendaftarBaru()
    {
        return $this->where('status_daftar', 'Baru')->findAll();
---
SELECT *
FROM `data_pendaftar`
WHERE `status_daftar` = 'Finalisasi'