app/Models/ModelCount.php

    public function countPendaftar()
    {
        return $this->db->table('data_pendaftar')->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `data_pendaftar`

    public function countDiterima()
    {
        return $this->db->table('data_pendaftar')->where('status_daftar', 'Diterima')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `data_pendaftar`
WHERE `status_daftar` = 'Diterima'

    public function countPendaftarLakiLaki()
    {
        return $this->db->table('data_pendaftar')->where('jenisKel', 'Laki-laki')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `data_pendaftar`
WHERE `jenisKel` = 'Laki-laki'

    public function countPendaftarPerempuan()
    {
        return $this->db->table('data_pendaftar')->where('jenisKel', 'Perempuan')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `data_pendaftar`
WHERE `jenisKel` = 'Perempuan'