app/Models/ModelAuth.php

INSERT INTO `user` (`email`, `username`, `password`, `foto`, `level`) VALUES ('ani@gmail.com', 'ani', '$2y$10$oqadFZ5xPINjkOWK7vGp6OnoTuhDF.WWRFy35iYdwRdPSbWPN1gcS', 'default.png', 2)
---
    public function saveRegister($data){
        $this->db->table('user')->insert($data);

SELECT *
FROM `user`
WHERE `email` = 'admin'
OR `username` = 'admin'
---
    public function login($identity, $password)
    {
        $user = $this->db->table('user')
                        ->where('email', $identity)
                        ->orWhere('username', $identity)
                        ->get()
                        ->getRowArray();