app/Models/ModelUser.php

    public function getUser($idUser = false)
    {
        if ($idUser == false) {
            return $this->where(['level' => 2])->findAll();
---
SELECT *
FROM `user`
WHERE `level` = 2