app/Models/ModelProfil.php

    public function getData()
    {
        return $this->findAll();
---
SELECT *
FROM `profil`