app/Models/ModelPendaftar.php

SELECT *
FROM `data_pendaftar`
JOIN `user` ON `user`.`idUser` = `data_pendaftar`.`idUser`
WHERE `idPendaftar` = '43'
 LIMIT 1
---
    public function getPendaftar($idPendaftar = false)
    {
        if ($idPendaftar == false) {
            return $this->join('user', 'user.idUser = data_pendaftar.idUser')->findAll();
        }
        return $this->where(['idPendaftar' => $idPendaftar])->join('user', 'user.idUser = data_pendaftar.idUser')->first();

SELECT *
FROM `data_pendaftar`
WHERE `data_pendaftar`.`idUser` = '23'
 LIMIT 1
---
    public function getPendaftarById($idUser = false)
    {
        if (!$idUser) return false;

        return $this->where('data_pendaftar.idUser', $idUser)->first();