app/Models/ModelBanner.php

SELECT *
FROM `banner`
---
    public function getData()
    {
        return $this->findAll();

SELECT *
FROM `banner`
WHERE `idBanner` = '3'
---
    public function getDataWhere($id)
    {
        return $this->getWhere(['idBanner' => $id]);